# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [63]:
# import libraries here
import pandas as pd
import numpy as np

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [64]:
# your code here
temp = pd.read_csv('Temp_States.csv')

#### Print `temp`.

In [65]:
# your code here
print(temp)

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [66]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [67]:
"""
We only have two data types: object for City and State; and float for the Temperature.
"""

'\nWe only have two data types: object for City and State; and float for the Temperature.\n'

#### Select the rows where state is New York.

In [68]:
# your code here
nyc = temp[temp['State'] == 'New York']

#### What is the average temperature of cities in New York?

In [69]:
# your code here
nyc["Temperature"].mean()

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [70]:
# your code here
temp[temp['Temperature'] > 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [71]:
# your code here
temp.loc[temp['Temperature'] > 15, 'City']

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [72]:
# your code here
temp.loc[(temp['Temperature'] > 15) & (temp['Temperature'] < 20), 'City']

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [73]:
# your code here
temp.groupby('State').agg(['mean', 'std'])

C:\Users\Arrulo dos Anjos\AppData\Local\Temp\ipykernel_19468\4077061232.py:2: FutureWarning: ['City'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  temp.groupby('State').agg(['mean', 'std'])

            Temperature
                   mean       std
State
Connecticut   15.833333  1.964186
New Jersey    21.111111  1.571348
New York      10.740741  8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [74]:
# your code here
employees = pd.read_csv('Employee.csv')
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [75]:
# your code here
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [76]:
"""
We have, once more, only 2 data types: Object for Name, Department, Education, Gender and Title; Int for Years and Salary.
"""

'\nWe have, once more, only 2 data types: Object for Name, Department, Education, Gender and Title; Int for Years and Salary.\n'

#### What's the average salary in this company?

In [77]:
# your code here
employees.Salary.mean()

48.888888888888886

#### What's the highest salary?

In [78]:
# your code here
employees.Salary.max()

70

#### What's the lowest salary?

In [79]:
# your code here
employees.Salary.min()

30

#### Who are the employees with the lowest salary?

In [80]:
# your code here
employees[employees['Salary'] == employees['Salary'].min()]

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [81]:
# your code here
employees[employees['Name'] == 'David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [82]:
# your code here
employees[employees.Name == 'David']['Salary']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [83]:
# your code here
employees[employees['Title'] == 'associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [84]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [85]:
# Method 2
# your code here
employees[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [86]:
# your code here
employees[(employees.Title == 'associate') & (employees.Salary > 55)]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [87]:
# your code here
employees.groupby('Years').agg({'Salary': 'mean'})

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [88]:
# your code here
employees.groupby('Title').agg({'Salary': 'mean'})

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [89]:
# your code here
q1 = employees['Salary'].quantile(0.25)
q2 = employees['Salary'].quantile(0.50)
q3 = employees['Salary'].quantile(0.75)

print(q1, q2, q3)

35.0 55.0 60.0

#### Is the mean salary different per gender?

In [90]:
# your code here
grouped = employees.groupby('Gender')
mean_salary = grouped['Salary'].mean()
mean_salary

Gender
F    47.5
M    50.0
Name: Salary, dtype: float64

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [91]:
# your code here
grouped = employees.groupby('Department')
stats = grouped['Salary'].agg(['min', 'mean', 'max'])
stats

            min   mean  max
Department
HR           30  45.00   70
IT           30  48.75   70
Sales        55  55.00   55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [92]:
# your code here
grouped = employees.groupby('Department')
diff = grouped['Salary'].agg(lambda x: x.max() - x.min())
diff

Department
HR       40
IT       40
Sales     0
Name: Salary, dtype: int64

In [93]:
employees[(employees.Department == 'Sales')]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [94]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [95]:
# your code here

In [96]:
"""

"""

'\n\n'

####  What is the average purchase price?

In [97]:
# your code here

#### What are the highest and lowest purchase prices?

In [98]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [99]:
# your code here

#### How many customers do we have in Spain?

In [100]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [101]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [102]:
# your code here

#### Select all free orders.

In [103]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [104]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [105]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [106]:
# your code here

#### Select all orders made in the month of August.

In [107]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here